AccumulationRegisters/ОстаткиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТовара</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>(удалить)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЦеныПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЦеныПродажи</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена0</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порог1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порог2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порог3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешитьПродажу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОчередьWebHook.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОчередьWebHook</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отправлен</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоследняяПопытка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Создан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытийWebHooks</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнвойсПродажи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Затрата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыСобытийWebHooks.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыСобытийWebHooks</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Цена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Остаток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтатусЗаказа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоСериям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуги</Name>
					<Comment>(удалить, заменен на ТипНоменклатуры)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретОтгрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПоставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Блок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяГруппыДляКонструктора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеТелеграм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПодбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПодбораНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьИзАссортимента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SKU</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/УчетныеЗаписиИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>УчетныеЗаписиИнтеграции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТокенАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКонтрагентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WebhookURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WebhookАктивен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WebhookToken</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьОстатки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Администратор</Name>
					<Comment> доступны данные всех учетных записей</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПревышениеЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьСнижениеЦенНа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Склады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/StockAPI_Остатки/Ext/Module.bsl
// Остатки StockAPI: обработчик GET /balances, запросы к ОстаткиТовара, серии из приходных.
// Зависимости: StockAPI_Утилиты, StockAPI_Цены, StockAPI_Справочники

// ─── Точка входа ─────────────────────────────────────────────────────────────

// Главная логика GET /balances.
// Возвращает Структура("КодОтвета, Тело") — Module.bsl преобразует в HTTP-ответ.
//
Функция ПолучитьОстатки(Запрос, КонтекстАвторизации) Экспорт
	
	Пагинация = StockAPI_Утилиты.ПараметрыПагинацииОстатков(Запрос);
	Если Пагинация.Ошибка <> "" Тогда
		Возврат Новый Структура("КодОтвета, Тело", 400, Новый Структура("error", Пагинация.Ошибка));
	КонецЕсли;
	
	ФильтрСклад = РазрешенныйСкладИзЗапроса(Запрос, КонтекстАвторизации.УчетнаяЗапись);
	Если ФильтрСклад.Ошибка <> "" Тогда
		Возврат Новый Структура("КодОтвета, Тело", 400, Новый Структура("error", ФильтрСклад.Ошибка));
	КонецЕсли;
	
	ФильтрВидЦены = ВидЦеныИзЗапроса(Запрос); 
	Если ФильтрВидЦены.Ошибка <> "" Тогда
		Возврат Новый Структура("КодОтвета, Тело", 400, Новый Структура("error", ФильтрВидЦены.Ошибка));
	КонецЕсли;
	
	ФильтрКоды = КодыНоменклатурыИзЗапроса(Запрос);
	Если ФильтрКоды.Ошибка <> "" Тогда
		Возврат Новый Структура("КодОтвета, Тело", 400, Новый Структура("error", ФильтрКоды.Ошибка));
	КонецЕсли;
	
	ФильтрБренд = БрендИзЗапроса(Запрос);
	Если ФильтрБренд.Ошибка <> "" Тогда
		Возврат Новый Структура("КодОтвета, Тело", 400, Новый Структура("error", ФильтрБренд.Ошибка));
	КонецЕсли;
	
	ТаблицаОстатков = ТаблицаОстатков(ФильтрСклад.Склады, ФильтрВидЦены.ВидЦены, ФильтрКоды.Коды, ФильтрБренд.Бренд);
	ВсегоНоменклатуры = ТаблицаОстатков.Количество();   
	РазмерСтраницы = Пагинация.pageSize;
	ВсегоСтраниц = StockAPI_Утилиты.ВсегоСтраницПагинации(ВсегоНоменклатуры, РазмерСтраницы);
	Пропустить = (Пагинация.page - 1) * РазмерСтраницы;
	
	РезультатВидЦены = ФильтрВидЦены.ВидЦены.Наименование;
	РезультатВалюта = ФильтрВидЦены.ВидЦены.Валюта.Наименование;
	
	МассивСтрок = Новый Массив;
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("ТЗ", ТаблицаОстатков); 
	Запр.УстановитьПараметр("НачНом", Пропустить + 1); 
	Запр.УстановитьПараметр("КонНом", Пропустить + РазмерСтраницы); 
	
	Запр.Текст = "ВЫБРАТЬ
	             |	ТЗ.НомСтроки КАК НомСтроки,
	             |	ТЗ.Номенклатура КАК Номенклатура,
	             |	ТЗ.Склад КАК Склад,
	             |	ТЗ.Остаток КАК Остаток,
	             |	ТЗ.Резерв КАК Резерв,
	             |	ТЗ.Цена0 КАК Цена0,
	             |	ТЗ.Цена1 КАК Цена1,
	             |	ТЗ.Цена2 КАК Цена2,
	             |	ТЗ.Цена3 КАК Цена3,
	             |	ТЗ.Порог1 КАК Порог1,
	             |	ТЗ.Порог2 КАК Порог2,
	             |	ТЗ.Порог3 КАК Порог3,
	             |	ТЗ.РазрешитьПродажу КАК РазрешитьПродажу
	             |ПОМЕСТИТЬ ВТ
	             |ИЗ
	             |	&ТЗ КАК ТЗ
	             |;
	             |
				//|ВЫБРАТЬ ПЕРВЫЕ " + РазмерСтраницы + ?(Пропустить > 0, " ПРОПУСТИТЬ " + Пропустить, "") + "
	           |ВЫБРАТЬ  
	             |	ВТ.Номенклатура КАК НоменклатураСсылка,
	             |	ВТ.Номенклатура.Код КАК КодНоменклатуры,
	             |	ВТ.Номенклатура.Наименование КАК Номенклатура,
	             |	ВТ.Номенклатура.SKU КАК SKU,
	             |	ВТ.Номенклатура.Производитель.Наименование КАК Производитель,
	             |	ВТ.Склад.Код КАК Склад,
	             |	ВТ.Остаток КАК Остаток,
	             |	ВТ.Резерв КАК Резерв,
	             |	isnull(ВТ.Цена0,0) КАК Цена0,
	             |	isnull(ВТ.Цена1,0) КАК Цена1,
	             |	isnull(ВТ.Цена2,0) КАК Цена2,
	             |	isnull(ВТ.Цена3,0) КАК Цена3,
	             |	isnull(ВТ.Порог1,0) КАК Порог1,
	             |	isnull(ВТ.Порог2,0) КАК Порог2,
	             |	isnull(ВТ.Порог3,0) КАК Порог3,
	             |	isnull(ВТ.РазрешитьПродажу,0) КАК РазрешитьПродажу,  
				 
				 |	ВЫБОР
				 |КОГДА ВТ.Номенклатура.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
				 |	ТОГДА ВТ.Номенклатура.Родитель.Наименование
				 |КОГДА ВТ.Номенклатура.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
				 |	ТОГДА ВТ.Номенклатура.Родитель.Родитель.Наименование
				 |КОГДА ВТ.Номенклатура.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
				 |	ТОГДА ВТ.Номенклатура.Родитель.Родитель.Родитель.Наименование
				 |КОГДА ВТ.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
				 |	ТОГДА ВТ.Номенклатура.Родитель.Родитель.Родитель.Родитель.Наименование
				 |КОГДА ВТ.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
				 |	ТОГДА ВТ.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Наименование
				 |ИНАЧЕ """"
				 |КОНЕЦ КАК Бренд,  
				 
				 |	ВЫБОР
				 |КОГДА ВТ.Номенклатура.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
				 |	ТОГДА ВТ.Номенклатура.Родитель.Код
				 |КОГДА ВТ.Номенклатура.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
				 |	ТОГДА ВТ.Номенклатура.Родитель.Родитель.Код
				 |КОГДА ВТ.Номенклатура.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
				 |	ТОГДА ВТ.Номенклатура.Родитель.Родитель.Родитель.Код
				 |КОГДА ВТ.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
				 |	ТОГДА ВТ.Номенклатура.Родитель.Родитель.Родитель.Родитель.Код
				 |КОГДА ВТ.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
				 |	ТОГДА ВТ.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Код
				 |ИНАЧЕ """"
				 |КОНЕЦ КАК КодБренда  

				 |ИЗ
	             |	ВТ КАК ВТ   
				 | ГДЕ ВТ.НомСтроки между &НачНом и &КонНом";
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Элемент = Новый Структура;
		Элемент.Вставить("priceType", 	РезультатВидЦены);
		Элемент.Вставить("currency",	РезультатВалюта);
		Элемент.Вставить("warehouse", 	Выборка.Склад);
		Элемент.Вставить("item", 		Выборка.Номенклатура);
		Элемент.Вставить("itemCode", 	StockAPI_Утилиты.КодВСтроку(Выборка.КодНоменклатуры));
		Элемент.Вставить("brand", 		Выборка.Бренд);
		Элемент.Вставить("brandCode", 	StockAPI_Утилиты.КодВСтроку(Выборка.КодБренда));
		Элемент.Вставить("itemSku", 	Выборка.SKU);
		Элемент.Вставить("manufacturer",Строка(Выборка.Производитель));
		Элемент.Вставить("balance",		StockAPI_Утилиты.КодВСтроку(Выборка.Остаток));
		Элемент.Вставить("reserve", 	StockAPI_Утилиты.КодВСтроку(Выборка.Резерв)); 
		мас = Новый Массив; 
		мас.Добавить(Новый Структура("priceQty,qty", Выборка.Цена0, 0));
		Для Порог = 1 По 3 Цикл
			Если Выборка["Цена" + Порог] > 0 Тогда
				мас.Добавить(Новый Структура("priceQty,qty", Выборка["Цена"+Порог], Выборка["Порог"+Порог]));
			КонецЕсли;
		КонецЦикла; 
		Элемент.Вставить("price",		мас);
		//Элемент.Вставить("allow",		Выборка.РазрешитьПродажу);
		МассивСтрок.Добавить(Элемент);
	КонецЦикла;
	
	ТелоОтвета = Новый Структура;
	ТелоОтвета.Вставить("page", 		Пагинация.page);
	ТелоОтвета.Вставить("pageSize", 	РазмерСтраницы);
	ТелоОтвета.Вставить("totalItems", 	ВсегоНоменклатуры);
	ТелоОтвета.Вставить("totalPages", 	ВсегоСтраниц);
	ТелоОтвета.Вставить("items", 		МассивСтрок);
	
	//Если ЗначениеЗаполнено(ФильтрСклады.warehouseId) Тогда
	//	ТелоОтвета.Вставить("warehouse", 		ФильтрСклад.Склад.Наименование);
	//	ТелоОтвета.Вставить("warehouseCode", 	ФильтрСклад.warehouseCode);
	//КонецЕсли;
	
	Возврат Новый Структура("КодОтвета, Тело", 200, ТелоОтвета);

	//========================================	
	
	
	
	
	
	
	
	
	
	//ВсегоНоменклатуры = КоличествоНоменклатурыНаОстатках(ФильтрСклады.Склад);
	//ВсегоСтраниц = StockAPI_Утилиты.ВсегоСтраницПагинации(ВсегоНоменклатуры, Пагинация.pageSize);
	//Пропустить = (Пагинация.page - 1) * Пагинация.pageSize;
	//НоменклатураСтраницы = НоменклатураНаОстаткахСтраница(Пагинация.pageSize, Пропустить, ФильтрСклады.Склад);
	//
	//Таблица = ТаблицаОстатковПоНоменклатуре(НоменклатураСтраницы, ФильтрСклады.Склад);
	//
	//МассивНоменклатуры = StockAPI_Цены.УникальнаяНоменклатураИзТаблицы(Таблица);
	//ЦеныПоНоменклатуре = StockAPI_Цены.ЗагрузитьЦеныПродажиВсехВидов(МассивНоменклатуры);
	//
	//Группы = Новый Соответствие;
	//
	//Для Каждого Стр Из Таблица Цикл
	//	
	//	//Если ССериями Тогда
	//	//	Ключ = КлючГруппыОстатков(Стр.warehouse, Стр.itemCode, Стр.batch);
	//	//Иначе
	//		Ключ = КлючГруппыОстатковСводно(Стр.warehouse, Стр.itemCode);
	//	//КонецЕсли;
	//	Элемент = Группы.Получить(Ключ);
	//	
	//	Если Элемент = Неопределено Тогда
	//		Элемент = Новый Структура;
	//		Элемент.Вставить("warehouse", Строка(Стр.warehouse));
	//		Элемент.Вставить("item", Строка(Стр.item));
	//		Элемент.Вставить("itemCode", Строка(Стр.itemCode));
	//		//Элемент.Вставить("sku", Строка(Стр.sku));
	//		//Элемент.Вставить("itemType", Строка(Стр.itemType));
	//		Элемент.Вставить("manufacturer", Строка(Стр.manufacturer));
	//		//Если ССериями Тогда
	//		//	Элемент.Вставить("batch", Строка(Стр.batch));
	//		//	Элемент.Вставить("serials", Новый Массив);
	//		//	Элемент.Вставить("units", Новый Массив);
	//		//КонецЕсли;
	//		Элемент.Вставить("qty", 0);
	//		Элемент.Вставить("reserve", 0);
	//		Элемент.Вставить("Номенклатура", Стр.Номенклатура);
	//		Группы.Вставить(Ключ, Элемент);
	//	КонецЕсли;
	//	
	//	Элемент.qty = Элемент.qty + Стр.qty;
	//	Элемент.reserve = Элемент.reserve + Стр.reserve;
	//	
	//	//Если ССериями Тогда
	//	//	
	//	//	Серия = СокрЛП(Стр.serialParty);
	//	//	Если Серия = "" Тогда
	//	//		МассивСерийПартии = СерииПоПартиям.Получить(Стр.Партия);
	//	//		Если МассивСерийПартии <> Неопределено И МассивСерийПартии.Количество() > 0 Тогда
	//	//			Серия = МассивСерийПартии[0];
	//	//		КонецЕсли;
	//	//	КонецЕсли;
	//	//	
	//	//	Единица = Новый Структура;
	//	//	Единица.Вставить("batchCode", Строка(Стр.batchCode));
	//	//	//Единица.Вставить("sku", Строка(Стр.sku));
	//	//	//Единица.Вставить("itemType", Строка(Стр.itemType));
	//	//	Единица.Вставить("manufacturer", Строка(Стр.manufacturer));
	//	//	Единица.Вставить("serial", Серия);
	//	//	Единица.Вставить("qty", Стр.qty);
	//	//	Элемент.units.Добавить(Единица);
	//	//	
	//	//	ДобавитьСерийникВМассив(Элемент.serials, Серия);
	//	//	
	//	//КонецЕсли;
	//	
	//КонецЦикла;
	//
	////Если ССериями Тогда
	////	Для Каждого КлючИЗначение Из Группы Цикл
	////		Элемент = КлючИЗначение.Значение;
	////		МассивДоп = СерииПоГруппе.Получить(КлючИЗначение.Ключ);
	////		Если МассивДоп <> Неопределено Тогда
	////			Для Каждого Серия Из МассивДоп Цикл
	////				ДобавитьСерийникВМассив(Элемент.serials, Серия);
	////			КонецЦикла;
	////		КонецЕсли;
	////	КонецЦикла;
	////КонецЕсли;
	//
	//Для Каждого КлючИЗначение Из Группы Цикл
	//	Элемент = КлючИЗначение.Значение;
	//	ЦеныНоменклатуры = ЦеныПоНоменклатуре.Получить(Элемент.Номенклатура);
	//	StockAPI_Цены.ДобавитьЦеныВСтруктуру(Элемент, ЦеныНоменклатуры, Элемент.qty, ВидЦены);
	//	//Если ССериями Тогда
	//	//	Для Каждого Единица Из Элемент.units Цикл
	//	//		StockAPI_Цены.ДобавитьЦеныВСтруктуру(Единица, ЦеныНоменклатуры, Единица.qty, ВидЦены);
	//	//	КонецЦикла;
	//	//КонецЕсли;
	//	Элемент.Удалить("Номенклатура");
	//КонецЦикла;
	//
	//МассивСтрок = Новый Массив;
	//Для Каждого КлючИЗначение Из Группы Цикл
	//	МассивСтрок.Добавить(КлючИЗначение.Значение);
	//КонецЦикла;
	//
	//ТелоОтвета = Новый Структура;
	//ТелоОтвета.Вставить("page", Пагинация.page);
	//ТелоОтвета.Вставить("pageSize", Пагинация.pageSize);
	//ТелоОтвета.Вставить("totalItems", ВсегоНоменклатуры);
	//ТелоОтвета.Вставить("totalPages", ВсегоСтраниц);
	//ТелоОтвета.Вставить("items", МассивСтрок);
	//Если ЗначениеЗаполнено(ФильтрСклады.Склад) Тогда
	//	ТелоОтвета.Вставить("warehouse", Строка(ФильтрСклады.Склад));
	//	ТелоОтвета.Вставить("warehouseCode", ФильтрСклады.warehouseCode);
	//КонецЕсли;
	//
	//Возврат Новый Структура("КодОтвета, Тело", 200, ТелоОтвета);
	
КонецФункции

Функция ТаблицаОстатков(Склады, ВидЦены, КодыНоменклатуры = Неопределено, Бренд = Неопределено)

	ФильтрПоКодам = КодыНоменклатуры <> Неопределено И КодыНоменклатуры.Количество() > 0;
	ФильтрПоБренду = ЗначениеЗаполнено(Бренд);

	запр = Новый Запрос;
	запр.УстановитьПараметр("Склады",			Склады);
	запр.УстановитьПараметр("ВидЦены",			ВидЦены);
	запр.УстановитьПараметр("ФильтрПоКодам", 	ФильтрПоКодам);
	запр.УстановитьПараметр("КодыНоменклатуры", ?(ФильтрПоКодам, КодыНоменклатуры, Новый Массив));
	запр.УстановитьПараметр("ФильтрПоБренду", 	ФильтрПоБренду);
	запр.УстановитьПараметр("Бренд", 			?(ФильтрПоБренду, Бренд, Справочники.Номенклатура.ПустаяСсылка()));
	//запр.Текст = "ВЫБРАТЬ
	//             |	ОстаткиТовара.Номенклатура КАК Номенклатура,
	//             |	ОстаткиТовара.Склад КАК Склад,
	//             |	ОстаткиТовара.ОстатокОстаток КАК Остаток,
	//             |	ОстаткиТовара.РезервОстаток КАК Резерв,
	//             |	ЦеныПродажи.Цена0 КАК Цена0,
	//             |	ЦеныПродажи.Цена1 КАК Цена1,
	//             |	ЦеныПродажи.Цена2 КАК Цена2,
	//             |	ЦеныПродажи.Цена3 КАК Цена3,
	//             |	ЦеныПродажи.Порог1 КАК Порог1,
	//             |	ЦеныПродажи.Порог2 КАК Порог2,
	//             |	ЦеныПродажи.Порог3 КАК Порог3,
	//             |	ЦеныПродажи.РазрешитьПродажу КАК РазрешитьПродажу
	//             |ИЗ
	//             |	РегистрНакопления.ОстаткиТовара.Остатки(, Склад В (&Склады)) КАК ОстаткиТовара
	//             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныПродажи.СрезПоследних(, ВидЦены = &ВидЦены) КАК ЦеныПродажи
	//             |		ПО ОстаткиТовара.Склад = ЦеныПродажи.Склад
	//             |			И ОстаткиТовара.Номенклатура = ЦеныПродажи.Номенклатура
	//             |ГДЕ
	//             |	ОстаткиТовара.ОстатокОстаток > 0
	//             |	И НЕ ОстаткиТовара.Номенклатура.ЗапретОтгрузки
	//             |	И ОстаткиТовара.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	//             |
	//             |УПОРЯДОЧИТЬ ПО
	//             |	Склад,
	//             |	Номенклатура";
	 запр.Текст = "ВЫБРАТЬ
	              |	Ост.Номенклатура КАК Номенклатура,
	              |	Ост.Склад КАК Склад,
	              |	Ост.ОстатокОстаток КАК Остаток,
	              |	Ост.РезервОстаток КАК Резерв
	              |ПОМЕСТИТЬ ВТОстатки
	              |ИЗ
	              |	РегистрНакопления.ОстаткиТовара.Остатки(
	              |			,
	              |			Склад В (&Склады)
	              |				И Номенклатура В
	              |					(ВЫБРАТЬ
	              |						Ном.Ссылка
	              |					ИЗ
	              |						Справочник.Номенклатура КАК Ном
	              |					ГДЕ
	              |						НЕ Ном.ЗапретОтгрузки
	              |						И Ном.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	              |						И (НЕ &ФильтрПоКодам
	              |							ИЛИ Ном.Код В (&КодыНоменклатуры))
	              |						И (НЕ &ФильтрПоБренду
	              |							ИЛИ Ном.Ссылка В ИЕРАРХИИ(&Бренд)))) КАК Ост
	              |ГДЕ
	              |	Ост.ОстатокОстаток > 0
	              |
	              |ИНДЕКСИРОВАТЬ ПО
	              |	Ост.Склад,
	              |	Ост.Номенклатура
	              |;  
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	Ост.Номенклатура КАК Номенклатура,
	              |	Ост.Склад КАК Склад,
	              |	Ост.Остаток КАК Остаток,
	              |	Ост.Резерв КАК Резерв,
	              |	Цены.Цена0 КАК Цена0,
	              |	Цены.Цена1 КАК Цена1,
	              |	Цены.Цена2 КАК Цена2,
	              |	Цены.Цена3 КАК Цена3,
	              |	Цены.Порог1 КАК Порог1,
	              |	Цены.Порог2 КАК Порог2,
	              |	Цены.Порог3 КАК Порог3,
	              |	Цены.РазрешитьПродажу КАК РазрешитьПродажу
	              |ИЗ
	              |	ВТОстатки КАК Ост
	              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныПродажи.СрезПоследних(
	              |				,
	              |				ВидЦены = &ВидЦены
	              |					И Склад В (&Склады)
	              |					И Номенклатура В
	              |						(ВЫБРАТЬ
	              |							ВТОстатки.Номенклатура
	              |						ИЗ
	              |							ВТОстатки)) КАК Цены
	              |		ПО Ост.Склад = Цены.Склад
	              |			И Ост.Номенклатура = Цены.Номенклатура
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	Склад,
	              |	Номенклатура";
 	Выгрузка = Запр.Выполнить().Выгрузить(); 
	
	Выгрузка.Колонки.Добавить("НомСтроки", Новый ОписаниеТипов("Число"));
	Номер = 0;
	Для Каждого Строка Из Выгрузка Цикл
		Номер = Номер + 1;
		Строка.НомСтроки = Номер;
	КонецЦикла;

	Возврат Выгрузка;
	
КонецФункции // ТаблицаОстатков()


// ─── Фильтр и пагинация ───────────────────────────────────────────────────────

Функция ВидЦеныИзЗапроса(Запрос)

	Результат = Новый Структура("ВидЦены, Ошибка", Неопределено, "");

	ПараметрКода = Запрос.ПараметрыЗапроса.Получить("priceType");
	Если ПараметрКода = Неопределено Тогда
		Результат.Ошибка = "Параметр priceType не найден.";
		Возврат Результат;
	КонецЕсли;
	
	ВидЦены = Справочники.ВидыЦен.НайтиПоНаименованию(ПараметрКода, Истина);
	Если ВидЦены = Справочники.ВидыЦен.ПустаяСсылка() Тогда
		Результат.Ошибка = СтрШаблон("Не найден вид цены %1.", ПараметрКода);
	Иначе
	    Результат.ВидЦены = ВидЦены;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ВидЦеныизЗапроса()


// Опциональный фильтр по кодам номенклатуры: itemCode (один код) или itemCodes (через запятую).
//
Функция КодыНоменклатурыИзЗапроса(Запрос)
	
	Результат = Новый Структура("Коды, Ошибка", Новый Массив, "");
	
	СтрокаКодов = StockAPI_Утилиты.СтрокаПараметраЗапроса(Запрос, "itemCodes");
	Если СтрокаКодов = "" Тогда
		СтрокаКодов = StockAPI_Утилиты.СтрокаПараметраЗапроса(Запрос, "itemCode");
	КонецЕсли;
	
	Если СтрокаКодов = "" Тогда
		Возврат Результат;
	КонецЕсли;
	
	УникальныеКоды = Новый Соответствие;
	Части = СтрРазделить(СтрокаКодов, ",", Ложь);
	Для Каждого Часть Из Части Цикл
		
		КодСтрокой = СокрЛП(Часть);
		Если КодСтрокой = "" Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			КодЧисло = Число(КодСтрокой);
		Исключение
			Результат.Ошибка = СтрШаблон("Параметр itemCode/itemCodes: код ""%1"" должен быть числом.", КодСтрокой);
			Возврат Результат;
		КонецПопытки;
		
		УникальныеКоды.Вставить(КодЧисло, Истина);
		
	КонецЦикла;
	
	Если УникальныеКоды.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого КлючИЗначение Из УникальныеКоды Цикл
		Результат.Коды.Добавить(КлючИЗначение.Ключ);
	КонецЦикла;
	
	ЗапросБД = Новый Запрос;
	ЗапросБД.УстановитьПараметр("Коды", Результат.Коды);
	ЗапросБД.Текст = "ВЫБРАТЬ
	                 |	Номенклатура.Код КАК Код
	                 |ИЗ
	                 |	Справочник.Номенклатура КАК Номенклатура
	                 |ГДЕ
	                 |	Номенклатура.Код В (&Коды)
	                 |	И НЕ Номенклатура.ПометкаУдаления";
	НайденныеКоды = Новый Соответствие;
	Выборка = ЗапросБД.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденныеКоды.Вставить(Выборка.Код, Истина);
	КонецЦикла;
	
	НеНайденные = Новый Массив;
	Для Каждого КодНоменклатуры Из Результат.Коды Цикл
		Если НайденныеКоды.Получить(КодНоменклатуры) = Неопределено Тогда
			НеНайденные.Добавить(StockAPI_Утилиты.КодВСтроку(КодНоменклатуры));
		КонецЕсли;
	КонецЦикла;
	
	Если НеНайденные.Количество() > 0 Тогда
		Результат.Ошибка = "Не найдена номенклатура с кодом: " + СтрСоединить(НеНайденные, ", ") + ".";
		Результат.Коды = Новый Массив;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Опциональный фильтр по бренду: brand (код или наименование группы первого уровня).
//
Функция БрендИзЗапроса(Запрос)
	
	Результат = Новый Структура("Бренд, Ошибка", Неопределено, "");
	
	СтрокаБренда = StockAPI_Утилиты.СтрокаПараметраЗапроса(Запрос, "brand");
	Если СтрокаБренда = "" Тогда
		Возврат Результат;
	КонецЕсли;
	
	ОшибкаПоиска = "";
	Бренд = StockAPI_Справочники.НайтиБренд(СтрокаБренда, ОшибкаПоиска);
	Если ОшибкаПоиска <> "" Тогда
		Результат.Ошибка = ОшибкаПоиска;
		Возврат Результат;
	КонецЕсли;
	
	Результат.Бренд = Бренд;
	Возврат Результат;
	
КонецФункции


// Фильтр по складу: warehouseId, warehouseCode или code (числовой код из /warehouses). 
// Если код задан, возвращает склад по коду из перечня разрешенных
// Если код не задан, возвращает массив разрешенных складов
//
Функция РазрешенныйСкладИзЗапроса(Запрос, УчетаяЗапись) Экспорт
	
	Результат = Новый Структура("Склады, Ошибка", Неопределено, "");
	
	ПараметрКода = Запрос.ПараметрыЗапроса.Получить("warehouseId");
	Если ПараметрКода = Неопределено Тогда
		ПараметрКода = Запрос.ПараметрыЗапроса.Получить("warehouseCode");
	КонецЕсли;
	Если ПараметрКода = Неопределено Тогда
		ПараметрКода = Запрос.ПараметрыЗапроса.Получить("code");
	КонецЕсли;
	Если ПараметрКода = Неопределено Тогда  
		КодЧисло = Неопределено;
	Иначе	
		Попытка
			КодЧисло = Число(СокрЛП(Строка(ПараметрКода)));
			//Результат.warehouseId = Строка(ПараметрКода);
		Исключение
			Результат.Ошибка = "Параметр warehouseId (или warehouseCode) должен быть числовым кодом склада.";
			Возврат Результат;
		КонецПопытки;
	КонецЕсли;
	
	Запр = Новый Запрос;  
	Запр.УстановитьПараметр("Код", КодЧисло);
	
	Если StockAPI_Утилиты.ЭтоАдминистраторAPI(УчетаяЗапись) Тогда
		Запр.УстановитьПараметр("ОбщиеСклады", StockAPI_Утилиты.СкладыОбщиеДляВсехУчетныхЗаписейAPI());
		Запр.Текст = "ВЫБРАТЬ
		             |	Склады.Ссылка КАК Склад
		             |ИЗ
		             |	Справочник.Склады КАК Склады
		             |ГДЕ
		             |	Склады.Ссылка В (&ОбщиеСклады)
		             |	И НЕ Склады.ПометкаУдаления
		             |	И ВЫБОР
		             |			КОГДА &Код = НЕОПРЕДЕЛЕНО
		             |				ТОГДА ИСТИНА
		             |			ИНАЧЕ Склады.Код = &Код
		             |		КОНЕЦ";
	Иначе
		Запр.УстановитьПараметр("УчетаяЗапись", УчетаяЗапись);
		Запр.Текст = "ВЫБРАТЬ
		             |	Склады.Склад КАК Склад
		             |ИЗ
		             |	Справочник.УчетныеЗаписиИнтеграции.Склады КАК Склады
		             |ГДЕ
		             |	Склады.Ссылка = &УчетаяЗапись
		             |	И НЕ Склады.Склад.ПометкаУдаления
		             |	И ВЫБОР
		             |			КОГДА &Код = НЕОПРЕДЕЛЕНО
		             |				ТОГДА ИСТИНА
		             |			ИНАЧЕ Склады.Склад.Код = &Код
		             |		КОНЕЦ";
	КонецЕсли;
	
	РезультатЗапроса = Запр.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Результат.Ошибка = "Нет доступа к указанному складу.";
	Иначе	
		Результат.Склады = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Склад");
	КонецЕсли;  
	
 	Возврат Результат;
	
	//Склад = Справочники.Склады.НайтиПоКоду(КодЧисло);
	//Если НЕ ЗначениеЗаполнено(Склад) Или Склад.ПометкаУдаления Тогда
	//	Результат.Ошибка = СтрШаблон("Склад с кодом %1 не найден.", СтрокаКода);
	//	Возврат Результат;
	//КонецЕсли;
	//
	//МассивДоступных = омСервер.МассивСкладов();
	//Если МассивДоступных.Количество() > 0 Тогда
	//	Доступен = Ложь;
	//	Для Каждого ДоступныйСклад Из МассивДоступных Цикл
	//		Если ДоступныйСклад = Склад Тогда
	//			Доступен = Истина;
	//			Прервать;
	//		КонецЕсли;
	//	КонецЦикла;
	//	Если НЕ Доступен Тогда
	//		Результат.Ошибка = "Нет доступа к указанному складу.";
	//		Возврат Результат;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Результат.Склад = Склад;
	//Результат.warehouseCode = StockAPI_Справочники.КодВСтроку(КодЧисло);
	//Возврат Результат;
	
КонецФункции

// ─── Запросы к РН ОстаткиТовара ──────────────────────────────────────────────

Функция КоличествоНоменклатурыНаОстатках(Склад = Неопределено)
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Ост.Номенклатура) КАК Количество
	            |ИЗ
	            |	РегистрНакопления.ОстаткиТовара.Остатки(, ) КАК Ост
	            |ГДЕ
	            |	Ост.ОстатокОстаток > 0
	            |{ГДЕ
	            |	(Ост.Склад = &Склад) КАК Поле2}";
	Зап.УстановитьПараметр("Склад", Склад);
	
	Выборка = Зап.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Количество;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция НоменклатураНаОстаткахСтраница(РазмерСтраницы, Пропустить, Склад = Неопределено)
	
	МассивНоменклатуры = Новый Массив;
	
	Если РазмерСтраницы <= 0 Тогда
		Возврат МассивНоменклатуры;
	КонецЕсли;
	
	Зап = Новый Запрос;
	Зап.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ " + РазмерСтраницы + ?(Пропустить > 0, " ПРОПУСТИТЬ " + Пропустить, "") + "
	|	Вложенный.Номенклатура КАК Номенклатура
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Ост.Номенклатура КАК Номенклатура,
	|		Ост.Номенклатура.Код КАК КодСортировки,
	|		Ост.Номенклатура.Наименование КАК НаименованиеСортировки
	|	ИЗ
	|		РегистрНакопления.ОстаткиТовара.Остатки(, ) КАК Ост
	|	ГДЕ
	|		Ост.ОстатокОстаток > 0
	|		И Ост.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	{ГДЕ
	|		(Ост.Склад = &Склад)}) КАК Вложенный
	|
	|УПОРЯДОЧИТЬ ПО
	|	Вложенный.КодСортировки,
	|	Вложенный.НаименованиеСортировки";
	Зап.УстановитьПараметр("Склад", Склад);
	
	Выборка = Зап.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивНоменклатуры.Добавить(Выборка.Номенклатура);
	КонецЦикла;
	
	Возврат МассивНоменклатуры;
	
КонецФункции

//Функция ТаблицаОстатковПоНоменклатуре(НоменклатураСтраницы, Склад = Неопределено)
//	
//	ПустаяТаблица = Новый ТаблицаЗначений;
//	ПустаяТаблица.Колонки.Добавить("warehouse");
//	ПустаяТаблица.Колонки.Добавить("Склад");
//	ПустаяТаблица.Колонки.Добавить("item");
//	ПустаяТаблица.Колонки.Добавить("itemCode");
//	//ПустаяТаблица.Колонки.Добавить("sku");
//	//ПустаяТаблица.Колонки.Добавить("itemType");
//	ПустаяТаблица.Колонки.Добавить("manufacturer");
//	ПустаяТаблица.Колонки.Добавить("Номенклатура");
//	//ПустаяТаблица.Колонки.Добавить("batch");
//	//ПустаяТаблица.Колонки.Добавить("batchCode");
//	//ПустаяТаблица.Колонки.Добавить("serialParty");
//	//ПустаяТаблица.Колонки.Добавить("Партия");
//	ПустаяТаблица.Колонки.Добавить("qty", Новый ОписаниеТипов("Число"));
//	ПустаяТаблица.Колонки.Добавить("reserve", Новый ОписаниеТипов("Число"));
//	
//	Если НоменклатураСтраницы.Количество() = 0 Тогда
//		Возврат ПустаяТаблица;
//	КонецЕсли;
//	
//	Зап = Новый Запрос;
//	Зап.Текст =
//	"ВЫБРАТЬ
//	|	Ост.Склад.Наименование КАК warehouse,
//	|	Ост.Склад КАК Склад,
//	|	Ост.Номенклатура.Наименование КАК item,
//	|	Ост.Номенклатура.Код КАК itemCode,
//	//|	Ост.Номенклатура.ВидНоменклатуры.Наименование КАК itemType,
//	|	Ост.Номенклатура.Производитель.Наименование КАК manufacturer,
//	|	Ост.Номенклатура КАК Номенклатура,
//	//|	Ост.Партия.Наименование КАК batch,
//	//|	Ост.Партия.Код КАК batchCode,
//	//|	Ост.Партия.Серия КАК serialParty,
//	//|	Ост.Партия КАК Партия,
//	|	Ост.ОстатокОстаток КАК qty,
//	|	Ост.РезервОстаток КАК reserve
//	|ИЗ
//	|	РегистрНакопления.ОстаткиТовара.Остатки(, ) КАК Ост
//	|ГДЕ
//	|	Ост.ОстатокОстаток > 0
//	|	И Ост.Номенклатура В(&Номенклатура)
//	|{ГДЕ
//	|		(Ост.Склад = &Склад)}";
//	Зап.УстановитьПараметр("Номенклатура", НоменклатураСтраницы);
//	Зап.УстановитьПараметр("Склад", Склад);
//	
//	Возврат Зап.Выполнить().Выгрузить();
//	
//КонецФункции

//Функция КлючГруппыОстатков(Склад, КодТовара, Партия)
//	Возврат Строка(Склад) + "|" + Строка(КодТовара) + "|" + Строка(Партия);
//КонецФункции

//Функция КлючГруппыОстатковСводно(Склад, КодТовара)
//	Возврат Строка(Склад) + "|" + Строка(КодТовара);
//КонецФункции

// ───  WebHook остатки товара ──────────────────────────────────────────────

// ПередЗаписью: при Замещение=Истина старые движения ещё доступны
// (нужно для отмены проведения, когда новый набор пустой).
//
Процедура WebHookОстаткиПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ИзмененияОстатков = Новый ТаблицаЗначений;
	ИзмененияОстатков.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ИзмененияОстатков.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	
	Для Каждого ЗаписьНабора Из Источник Цикл
		ДобавитьИзменениеОстатковДляWebHook(ИзмененияОстатков, ЗаписьНабора.Номенклатура, ЗаписьНабора.Склад);
	КонецЦикла;
	
	Регистратор = РегистраторНабораОстатков(Источник);
	Если Замещение И ЗначениеЗаполнено(Регистратор) Тогда
		ДобавитьСтарыеИзмененияОстатковДляWebHook(ИзмененияОстатков, Регистратор);
	КонецЕсли;
	
	Если ИзмененияОстатков.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИзмененияОстатков", ИзмененияОстатков);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ИзмененияОстатков.Номенклатура КАК Номенклатура,
	               |	ИзмененияОстатков.Склад КАК Склад
	               |ПОМЕСТИТЬ ИзмененияОстатков
	               |ИЗ
	               |	&ИзмененияОстатков КАК ИзмененияОстатков
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	УчетныеЗаписи.Ссылка КАК УчетнаяЗапись,
	               |	ИзмененияОстатков.Номенклатура КАК Номенклатура,
	               |	ИзмененияОстатков.Склад КАК Склад
	               |ИЗ
	               |	ИзмененияОстатков КАК ИзмененияОстатков
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УчетныеЗаписиИнтеграции.Склады КАК СкладыУчетныхЗаписей
	               |		ПО ИзмененияОстатков.Склад = СкладыУчетныхЗаписей.Склад
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК СправочникСклады
	               |		ПО ИзмененияОстатков.Склад = СправочникСклады.Ссылка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УчетныеЗаписиИнтеграции КАК УчетныеЗаписи
	               |		ПО СкладыУчетныхЗаписей.Ссылка = УчетныеЗаписи.Ссылка
	               |ГДЕ
	               |	УчетныеЗаписи.Активен
	               |	И УчетныеЗаписи.WebhookАктивен
	               |	И УчетныеЗаписи.ОтправлятьОстатки
	               |	И УчетныеЗаписи.WebhookURL <> """"
	               |	И НЕ СправочникСклады.ПометкаУдаления";
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	Выборка = РезультатыЗапроса[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПерезаполнитьОчередьWebHookОстатки(Выборка.УчетнаяЗапись, Выборка.Номенклатура, Выборка.Склад, Регистратор);
	КонецЦикла;
		
КонецПроцедуры

Процедура ДобавитьИзменениеОстатковДляWebHook(ИзмененияОстатков, Номенклатура, Склад)
	
	Если НЕ ЗначениеЗаполнено(Номенклатура)
		Или НЕ ЗначениеЗаполнено(Склад) Тогда
		Возврат;
	КонецЕсли;
	
	НайдСтроки = ИзмененияОстатков.НайтиСтроки(Новый Структура("Номенклатура,Склад", Номенклатура, Склад));
	Если НайдСтроки.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = ИзмененияОстатков.Добавить();
	НоваяСтрока.Номенклатура = Номенклатура;
	НоваяСтрока.Склад = Склад;
	
КонецПроцедуры

Функция РегистраторНабораОстатков(Источник)
	
	Попытка
		Если Источник.Отбор.Регистратор.Использование Тогда
			Возврат Источник.Отбор.Регистратор.Значение;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ДобавитьСтарыеИзмененияОстатковДляWebHook(ИзмененияОстатков, Регистратор)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ОстаткиТовара.Номенклатура КАК Номенклатура,
	               |	ОстаткиТовара.Склад КАК Склад
	               |ИЗ
	               |	РегистрНакопления.ОстаткиТовара КАК ОстаткиТовара
	               |ГДЕ
	               |	ОстаткиТовара.Регистратор = &Регистратор";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДобавитьИзменениеОстатковДляWebHook(ИзмененияОстатков, Выборка.Номенклатура, Выборка.Склад);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПерезаполнитьОчередьWebHookОстатки(УчетнаяЗапись, Номенклатура, Склад, Регистратор)
	
	ТипСобытия = Перечисления.ТипыСобытийWebHooks.Остаток;
	ПустойВидЦены = Справочники.ВидыЦен.ПустаяСсылка();
	ПустаяДатаОтправки = Дата(1, 1, 1);
	
	УдалитьНеотправленныеЗаписиОчередиWebHookОстатки(УчетнаяЗапись, Номенклатура, Склад, ТипСобытия, ПустойВидЦены, ПустаяДатаОтправки);
	
	НоваяЗапись = РегистрыСведений.ОчередьWebHook.СоздатьМенеджерЗаписи();
	НоваяЗапись.ИД = Новый УникальныйИдентификатор;
	НоваяЗапись.УчетнаяЗапись = УчетнаяЗапись;
	НоваяЗапись.ТипСобытия = ТипСобытия;
	НоваяЗапись.Номенклатура = Номенклатура;
	НоваяЗапись.Склад = Склад;
	НоваяЗапись.ВидЦены = ПустойВидЦены;
	НоваяЗапись.Отправлен = ПустаяДатаОтправки;
	НоваяЗапись.Создан = ТекущаяДатаСеанса();
	НоваяЗапись.КоличествоПопыток = 0;
	НоваяЗапись.Ошибка = "";
	
	Если ЗначениеЗаполнено(Регистратор) Тогда
		Попытка
			НоваяЗапись.Инициатор = Регистратор;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	НоваяЗапись.Записать();
	
КонецПроцедуры

Процедура УдалитьНеотправленныеЗаписиОчередиWebHookОстатки(УчетнаяЗапись, Номенклатура, Склад, ТипСобытия, ПустойВидЦены, ПустаяДатаОтправки)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	Запрос.УстановитьПараметр("ТипСобытия", ТипСобытия);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ВидЦены", ПустойВидЦены);
	Запрос.УстановитьПараметр("Отправлен", ПустаяДатаОтправки);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОчередьWebHook.ИД КАК ИД,
	               |	ОчередьWebHook.УчетнаяЗапись КАК УчетнаяЗапись,
	               |	ОчередьWebHook.ТипСобытия КАК ТипСобытия,
	               |	ОчередьWebHook.Номенклатура КАК Номенклатура,
	               |	ОчередьWebHook.Склад КАК Склад,
	               |	ОчередьWebHook.ВидЦены КАК ВидЦены,
	               |	ОчередьWebHook.Отправлен КАК Отправлен
	               |ИЗ
	               |	РегистрСведений.ОчередьWebHook КАК ОчередьWebHook
	               |ГДЕ
	               |	ОчередьWebHook.УчетнаяЗапись = &УчетнаяЗапись
	               |	И ОчередьWebHook.ТипСобытия = &ТипСобытия
	               |	И ОчередьWebHook.Номенклатура = &Номенклатура
	               |	И ОчередьWebHook.Склад = &Склад
	               |	И ОчередьWebHook.ВидЦены = &ВидЦены
	               |	И ОчередьWebHook.Отправлен = &Отправлен";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаписьОчереди = РегистрыСведений.ОчередьWebHook.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ЗаписьОчереди, Выборка);
		ЗаписьОчереди.Удалить();
	КонецЦикла;
	
КонецПроцедуры
